_posts/2018-01-22-recursive-http-with-elm.html
---
title: "Recursive HTTP Requests with Elm"
author: "Correl Roush"
tags: elm programming
---
<p>
So I got the idea in my head that I wanted to pull data from the
GitLab / GitHub APIs in my Elm app. This seemed straightforward
enough; just wire up an HTTP request and a JSON decoder, and off I go.
Then I remember, oh crap&#x2026; like any sensible API with a potentially
huge amount of data behind it, the results come back <i>paginated</i>. For
anyone unfamiliar, this means that a single API request for a list of,
say, repositories, is only going to return up to some maximum number
of results. If there are more results available, there will be a
reference to additional <i>pages</i> of results, that you can then fetch
with <i>another</i> API request. My single request decoding only the
results returned <i>from</i> that single request wasn't going to cut it.
</p>

<p>
I had a handful of problems to solve. I needed to:
</p>

<ul class="org-ul">
<li>Detect when additional results were available.</li>
<li>Parse out the URL to use to fetch the next page of results.</li>
<li>Continue fetching results until none remained.</li>
<li>Combine all of the results, maintaining their order.</li>
</ul>

<div id="outline-container-org74ec6f4" class="outline-2">
<h2 id="org74ec6f4">Are there more results?</h2>
<div class="outline-text-2" id="text-org74ec6f4">
<p>
The first two bullet points can be dealt with by parsing and
inspecting the response header. Both GitHub and GitLab embed
pagination links in the <a href="https://www.w3.org/wiki/LinkHeader">HTTP Link header</a>. As I'm interested in
consuming pages until no further results remain, I'll be looking for a
link in the header with the relationship "next". If I find one, I know
I need to hit the associated URL to fetch more results. If I don't
find one, I'm done!
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Example GitHub Link header</label><pre class="src src-http">Link<span style="color: #6c6c6c; font-style: italic;">:</span> <a href="https://api.github.com/user/repos?page=3&amp;per_page=100">&lt;https</a><span style="color: #6c6c6c; font-style: italic;"><a href="https://api.github.com/user/repos?page=3&amp;per_page=100">:</a></span><a href="https://api.github.com/user/repos?page=3&amp;per_page=100">//api.github.com/user/repos</a><span style="color: #6c6c6c; font-style: italic;"><a href="https://api.github.com/user/repos?page=3&amp;per_page=100">?</a></span><span style="color: #ff8700;"><a href="https://api.github.com/user/repos?page=3&amp;per_page=100">page</a></span><span style="color: #6c6c6c; font-style: italic;"><a href="https://api.github.com/user/repos?page=3&amp;per_page=100">=</a></span><span style="color: #ff4ea3;"><a href="https://api.github.com/user/repos?page=3&amp;per_page=100">3</a></span><span style="color: #6c6c6c; font-style: italic;"><a href="https://api.github.com/user/repos?page=3&amp;per_page=100">&amp;</a></span><span style="color: #ff8700;"><a href="https://api.github.com/user/repos?page=3&amp;per_page=100">per_page</a></span><span style="color: #6c6c6c; font-style: italic;"><a href="https://api.github.com/user/repos?page=3&amp;per_page=100">=</a></span><a href="https://api.github.com/user/repos?page=3&amp;per_page=100">100&gt;</a>; rel<span style="color: #6c6c6c; font-style: italic;">=</span><span style="color: #ff4ea3;">"next"</span><span style="color: #6c6c6c; font-style: italic;">,</span>
  <a href="https://api.github.com/user/repos?page=50&amp;per_page=100">&lt;https</a><span style="color: #6c6c6c; font-style: italic;"><a href="https://api.github.com/user/repos?page=50&amp;per_page=100">:</a></span><a href="https://api.github.com/user/repos?page=50&amp;per_page=100">//api.github.com/user/repos</a><span style="color: #6c6c6c; font-style: italic;"><a href="https://api.github.com/user/repos?page=50&amp;per_page=100">?</a></span><span style="color: #ff8700;"><a href="https://api.github.com/user/repos?page=50&amp;per_page=100">page</a></span><span style="color: #6c6c6c; font-style: italic;"><a href="https://api.github.com/user/repos?page=50&amp;per_page=100">=</a></span><span style="color: #ff4ea3;"><a href="https://api.github.com/user/repos?page=50&amp;per_page=100">50</a></span><span style="color: #6c6c6c; font-style: italic;"><a href="https://api.github.com/user/repos?page=50&amp;per_page=100">&amp;</a></span><span style="color: #ff8700;"><a href="https://api.github.com/user/repos?page=50&amp;per_page=100">per_page</a></span><span style="color: #6c6c6c; font-style: italic;"><a href="https://api.github.com/user/repos?page=50&amp;per_page=100">=</a></span><a href="https://api.github.com/user/repos?page=50&amp;per_page=100">100&gt;</a>; rel<span style="color: #6c6c6c; font-style: italic;">=</span><span style="color: #ff4ea3;">"last"</span>
</pre>
</div>

<p>
Parsing this stuff out went straight into a utility module.
</p>

<div class="org-src-container">
<pre class="src src-elm"><span style="color: #a1db00;">module</span> <span style="color: #00d7af;">Paginated</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Util</span> <span style="color: #a1db00;">exposing</span> (links)

<span style="color: #a1db00;">import</span> <span style="color: #00d7af;">Dict</span> <span style="color: #a1db00;">exposing</span> (<span style="color: #00d7af;">Dict</span>)
<span style="color: #a1db00;">import</span> <span style="color: #00d7af;">Maybe</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Extra</span>
<span style="color: #a1db00;">import</span> <span style="color: #00d7af;">Regex</span>


<span style="color: #6c6c6c; font-style: italic;">{-| Parse an HTTP Link header into a dictionary. For example, to look</span>
<span style="color: #6c6c6c; font-style: italic;">for a link to additional results in an API response, you could do the</span>
<span style="color: #6c6c6c; font-style: italic;">following:</span>

<span style="color: #6c6c6c; font-style: italic;">    Dict.get "Link" response.headers</span>
<span style="color: #6c6c6c; font-style: italic;">        |&gt; Maybe.map links</span>
<span style="color: #6c6c6c; font-style: italic;">        |&gt; Maybe.andThen (Dict.get "next")</span>

<span style="color: #6c6c6c; font-style: italic;">-}</span>
<span style="color: #ffd700;">links</span> <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">String</span> <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Dict</span> <span style="color: #00d7af;">String</span> <span style="color: #00d7af;">String</span>
<span style="color: #ffd700;">links</span> s <span style="color: #d18aff;">=</span>
    <span style="color: #a1db00;">let</span>
        toTuples xs <span style="color: #d18aff;">=</span>
            <span style="color: #a1db00;">case</span> xs <span style="color: #a1db00;">of</span>
                [ <span style="color: #00d7af;">Just</span> a<span style="color: #d18aff;">,</span> <span style="color: #00d7af;">Just</span> b ] <span style="color: #d18aff;">-&gt;</span>
                    <span style="color: #00d7af;">Just</span> ( b<span style="color: #d18aff;">,</span> a )

                _ <span style="color: #d18aff;">-&gt;</span>
                    <span style="color: #00d7af;">Nothing</span>
    <span style="color: #a1db00;">in</span>
        <span style="color: #00d7af;">Regex</span><span style="color: #d18aff;">.</span>find
            <span style="color: #00d7af;">Regex</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">All</span>
            (<span style="color: #00d7af;">Regex</span><span style="color: #d18aff;">.</span>regex <span style="color: #ff4ea3;">"&lt;(.*?)&gt;; rel=\"</span>(<span style="color: #d18aff;">.*</span>?)<span style="color: #d18aff;">\</span><span style="color: #ff4ea3;">""</span>)
            s
            <span style="color: #d18aff;">|&gt;</span> <span style="color: #00d7af;">List</span><span style="color: #d18aff;">.</span>map <span style="color: #d18aff;">.</span>submatches
            <span style="color: #d18aff;">|&gt;</span> <span style="color: #00d7af;">List</span><span style="color: #d18aff;">.</span>map toTuples
            <span style="color: #d18aff;">|&gt;</span> <span style="color: #00d7af;">Maybe</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Extra</span><span style="color: #d18aff;">.</span>values
            <span style="color: #d18aff;">|&gt;</span> <span style="color: #00d7af;">Dict</span><span style="color: #d18aff;">.</span>fromList
</pre>
</div>

<p>
A little bit of regular expression magic, tuples, and
<code>Maybe.Extra.values</code> to keep the matches, and now I've got my
(<code>Maybe</code>) URL.
</p>
</div>
</div>
