_posts/2018-01-22-recursive-http-with-elm.html

<div id="outline-container-org37fcbcb" class="outline-2">
<h2 id="org37fcbcb">Time to make some requests</h2>
<div class="outline-text-2" id="text-org37fcbcb">
<p>
Now's the time to define some types. I'll need a <code>Request</code>, which will
be similar to a standard <code>Http.Request</code>, with a <i>slight</i> difference.
</p>

<div class="org-src-container">
<pre class="src src-elm"><span style="color: #a1db00;">type</span> <span style="color: #a1db00;">alias</span> <span style="color: #00d7af;">RequestOptions</span> a <span style="color: #d18aff;">=</span>
    <span style="color: #a1db00;">{</span> method <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">String</span>
    <span style="color: #a1db00;">,</span> headers <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">List</span> <span style="color: #00d7af;">Http</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Header</span>
    <span style="color: #a1db00;">,</span> url <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">String</span>
    <span style="color: #a1db00;">,</span> body <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">Http</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Body</span>
    <span style="color: #a1db00;">,</span> decoder <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">Decoder</span> a
    <span style="color: #a1db00;">,</span> timeout <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">Maybe</span> <span style="color: #00d7af;">Time</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Time</span>
    <span style="color: #a1db00;">,</span> withCredentials <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">Bool</span>
    <span style="color: #a1db00;">}</span>


<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">Request</span> a
    <span style="color: #d18aff;">=</span> <span style="color: #00d7af;">Request</span> (<span style="color: #00d7af;">RequestOptions</span> a)
</pre>
</div>

<p>
What separates it from a basic <code>Http.Request</code> is the <code>decoder</code> field
instead of an <code>expect</code> field. The <code>expect</code> field in an HTTP request is
responsible for parsing the full response into whatever result the
caller wants. For my purposes, I always intend to be hitting a JSON
API returning a list of items, and I have my own designs on parsing
bits of the request to pluck out the headers. Therefore, I expose only
a slot for including a JSON decoder representing the type of item I'll
be getting a collection of.
</p>

<p>
I'll also need a <code>Response</code>, which will either be <code>Partial</code>
(containing the results from the response, plus a <code>Request</code> for
getting the next batch), or <code>Complete</code>.
</p>

<div class="org-src-container">
<pre class="src src-elm"><span style="color: #a1db00;">type</span> <span style="color: #00d7af;">Response</span> a
    <span style="color: #d18aff;">=</span> <span style="color: #00d7af;">Partial</span> (<span style="color: #00d7af;">Request</span> a) (<span style="color: #00d7af;">List</span> a)
    <span style="color: #d18aff;">|</span> <span style="color: #00d7af;">Complete</span> (<span style="color: #00d7af;">List</span> a)
</pre>
</div>

<p>
Sending the request isn't too bad. I can just convert my request into
an <code>Http.Request</code>, and use <code>Http.send</code>.
</p>

<div class="org-src-container">
<pre class="src src-elm"><span style="color: #ffd700;">send</span> <span style="color: #d18aff;">:</span>
    (<span style="color: #00d7af;">Result</span> <span style="color: #00d7af;">Http</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Error</span> (<span style="color: #00d7af;">Response</span> a) <span style="color: #d18aff;">-&gt;</span> msg)
    <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Request</span> a
    <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Cmd</span> msg
<span style="color: #ffd700;">send</span> resultToMessage request <span style="color: #d18aff;">=</span>
    <span style="color: #00d7af;">Http</span><span style="color: #d18aff;">.</span>send resultToMessage <span style="color: #d18aff;">&lt;|</span>
        httpRequest request


<span style="color: #ffd700;">httpRequest</span> <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">Request</span> a <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Http</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Request</span> (<span style="color: #00d7af;">Response</span> a)
<span style="color: #ffd700;">httpRequest</span> (<span style="color: #00d7af;">Request</span> options) <span style="color: #d18aff;">=</span>
    <span style="color: #00d7af;">Http</span><span style="color: #d18aff;">.</span>request
        <span style="color: #a1db00;">{</span> method <span style="color: #d18aff;">=</span> options<span style="color: #d18aff;">.</span>method
        <span style="color: #a1db00;">,</span> headers <span style="color: #d18aff;">=</span> options<span style="color: #d18aff;">.</span>headers
        <span style="color: #a1db00;">,</span> url <span style="color: #d18aff;">=</span> options<span style="color: #d18aff;">.</span>url
        <span style="color: #a1db00;">,</span> body <span style="color: #d18aff;">=</span> options<span style="color: #d18aff;">.</span>body
        <span style="color: #a1db00;">,</span> expect <span style="color: #d18aff;">=</span> expect options
        <span style="color: #a1db00;">,</span> timeout <span style="color: #d18aff;">=</span> options<span style="color: #d18aff;">.</span>timeout
        <span style="color: #a1db00;">,</span> withCredentials <span style="color: #d18aff;">=</span> options<span style="color: #d18aff;">.</span>withCredentials
        <span style="color: #a1db00;">}</span>


<span style="color: #ffd700;">expect</span> <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">RequestOptions</span> a <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Http</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Expect</span> (<span style="color: #00d7af;">Response</span> a)
<span style="color: #ffd700;">expect</span> options <span style="color: #d18aff;">=</span>
    <span style="color: #00d7af;">Http</span><span style="color: #d18aff;">.</span>expectStringResponse (fromResponse options)
</pre>
</div>

<p>
All of my special logic for handling the headers, mapping the decoder
over the results, and packing them up into a <code>Response</code> is baked into
my <code>Http.Request</code> via a private <code>fromResponse</code> translator:
</p>

<div class="org-src-container">
<pre class="src src-elm"><span style="color: #ffd700;">fromResponse</span> <span style="color: #d18aff;">:</span>
    <span style="color: #00d7af;">RequestOptions</span> a
    <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Http</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Response</span> <span style="color: #00d7af;">String</span>
    <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Result</span> <span style="color: #00d7af;">String</span> (<span style="color: #00d7af;">Response</span> a)
<span style="color: #ffd700;">fromResponse</span> options response <span style="color: #d18aff;">=</span>
    <span style="color: #a1db00;">let</span>
        items <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">Result</span> <span style="color: #00d7af;">String</span> (<span style="color: #00d7af;">List</span> a)
        items <span style="color: #d18aff;">=</span>
            <span style="color: #00d7af;">Json</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Decode</span><span style="color: #d18aff;">.</span>decodeString
                (<span style="color: #00d7af;">Json</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Decode</span><span style="color: #d18aff;">.</span>list options<span style="color: #d18aff;">.</span>decoder)
                response<span style="color: #d18aff;">.</span>body

        nextPage <span style="color: #d18aff;">=</span>
            <span style="color: #00d7af;">Dict</span><span style="color: #d18aff;">.</span>get <span style="color: #ff4ea3;">"Link"</span> response<span style="color: #d18aff;">.</span>headers
                <span style="color: #d18aff;">|&gt;</span> <span style="color: #00d7af;">Maybe</span><span style="color: #d18aff;">.</span>map <span style="color: #00d7af;">Paginated</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Util</span><span style="color: #d18aff;">.</span>links
                <span style="color: #d18aff;">|&gt;</span> <span style="color: #00d7af;">Maybe</span><span style="color: #d18aff;">.</span>andThen (<span style="color: #00d7af;">Dict</span><span style="color: #d18aff;">.</span>get <span style="color: #ff4ea3;">"next"</span>)
    <span style="color: #a1db00;">in</span>
        <span style="color: #a1db00;">case</span> nextPage <span style="color: #a1db00;">of</span>
            <span style="color: #00d7af;">Nothing</span> <span style="color: #d18aff;">-&gt;</span>
                <span style="color: #00d7af;">Result</span><span style="color: #d18aff;">.</span>map <span style="color: #00d7af;">Complete</span> items

            <span style="color: #00d7af;">Just</span> url <span style="color: #d18aff;">-&gt;</span>
                <span style="color: #00d7af;">Result</span><span style="color: #d18aff;">.</span>map
                    (<span style="color: #00d7af;">Partial</span> (request { options <span style="color: #d18aff;">|</span> url <span style="color: #d18aff;">=</span> url }))
                    items
</pre>
</div>
</div>
</div>
