_posts/2018-01-22-recursive-http-with-elm.html

<div id="outline-container-org0bb2b9b" class="outline-2">
<h2 id="org0bb2b9b">Putting it together</h2>
<div class="outline-text-2" id="text-org0bb2b9b">
<p>
Now, I can make my API request, and get back a response with
potentially partial results. All that needs to be done now is to make
my request, and iterate on the results I get back in my <code>update</code>
method.
</p>

<p>
To make things a bit easier, I add a method for concatenating two
responses:
</p>

<div class="org-src-container">
<pre class="src src-elm"><span style="color: #ffd700;">update</span> <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">Response</span> a <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Response</span> a <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Response</span> a
<span style="color: #ffd700;">update</span> old new <span style="color: #d18aff;">=</span>
    <span style="color: #a1db00;">case</span> ( old<span style="color: #d18aff;">,</span> new ) <span style="color: #a1db00;">of</span>
        ( <span style="color: #00d7af;">Complete</span> items<span style="color: #d18aff;">,</span> _ ) <span style="color: #d18aff;">-&gt;</span>
            <span style="color: #00d7af;">Complete</span> items

        ( <span style="color: #00d7af;">Partial</span> _ oldItems<span style="color: #d18aff;">,</span> <span style="color: #00d7af;">Complete</span> newItems ) <span style="color: #d18aff;">-&gt;</span>
            <span style="color: #00d7af;">Complete</span> (oldItems <span style="color: #d18aff;">++</span> newItems)

        ( <span style="color: #00d7af;">Partial</span> _ oldItems<span style="color: #d18aff;">,</span> <span style="color: #00d7af;">Partial</span> request newItems ) <span style="color: #d18aff;">-&gt;</span>
            <span style="color: #00d7af;">Partial</span> request (oldItems <span style="color: #d18aff;">++</span> newItems)
</pre>
</div>

<p>
Putting it all together, I get a fully functional test app that
fetches a paginated list of repositories from GitLab, and renders them
when I've fetched them all:
</p>

<div class="org-src-container">
<pre class="src src-elm"><span style="color: #a1db00;">module</span> <span style="color: #00d7af;">Example</span> <span style="color: #a1db00;">exposing</span> (<span style="color: #d18aff;">..</span>)

<span style="color: #a1db00;">import</span> <span style="color: #00d7af;">Html</span> <span style="color: #a1db00;">exposing</span> (<span style="color: #00d7af;">Html</span>)
<span style="color: #a1db00;">import</span> <span style="color: #00d7af;">Http</span>
<span style="color: #a1db00;">import</span> <span style="color: #00d7af;">Json</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Decode</span> <span style="color: #a1db00;">exposing</span> (field<span style="color: #d18aff;">,</span> string)
<span style="color: #a1db00;">import</span> <span style="color: #00d7af;">Paginated</span> <span style="color: #a1db00;">exposing</span> (<span style="color: #00d7af;">Response</span>(<span style="color: #d18aff;">..</span>))


<span style="color: #a1db00;">type</span> <span style="color: #a1db00;">alias</span> <span style="color: #00d7af;">Model</span> <span style="color: #d18aff;">=</span>
    { repositories <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">Maybe</span> (<span style="color: #00d7af;">Response</span> <span style="color: #00d7af;">String</span>) }


<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">Msg</span>
    <span style="color: #d18aff;">=</span> <span style="color: #00d7af;">GotRepositories</span> (<span style="color: #00d7af;">Result</span> <span style="color: #00d7af;">Http</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Error</span> (<span style="color: #00d7af;">Paginated</span><span style="color: #d18aff;">.</span><span style="color: #00d7af;">Response</span> <span style="color: #00d7af;">String</span>))


<span style="color: #ffd700;">main</span> <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">Program</span> <span style="color: #00d7af;">Never</span> <span style="color: #00d7af;">Model</span> <span style="color: #00d7af;">Msg</span>
<span style="color: #ffd700;">main</span> <span style="color: #d18aff;">=</span>
    <span style="color: #00d7af;">Html</span><span style="color: #d18aff;">.</span>program
        <span style="color: #a1db00;">{</span> init <span style="color: #d18aff;">=</span> init
        <span style="color: #a1db00;">,</span> update <span style="color: #d18aff;">=</span> update
        <span style="color: #a1db00;">,</span> view <span style="color: #d18aff;">=</span> view
        <span style="color: #a1db00;">,</span> subscriptions <span style="color: #d18aff;">=</span> <span style="color: #d18aff;">\</span>_ <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Sub</span><span style="color: #d18aff;">.</span>none
        <span style="color: #a1db00;">}</span>


<span style="color: #ffd700;">init</span> <span style="color: #d18aff;">:</span> ( <span style="color: #00d7af;">Model</span><span style="color: #d18aff;">,</span> <span style="color: #00d7af;">Cmd</span> <span style="color: #00d7af;">Msg</span> )
<span style="color: #ffd700;">init</span> <span style="color: #d18aff;">=</span>
    ( { repositories <span style="color: #d18aff;">=</span> <span style="color: #00d7af;">Nothing</span> }
    <span style="color: #a1db00;">,</span> getRepositories
    )


<span style="color: #ffd700;">update</span> <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">Msg</span> <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Model</span> <span style="color: #d18aff;">-&gt;</span> ( <span style="color: #00d7af;">Model</span><span style="color: #d18aff;">,</span> <span style="color: #00d7af;">Cmd</span> <span style="color: #00d7af;">Msg</span> )
<span style="color: #ffd700;">update</span> msg model <span style="color: #d18aff;">=</span>
    <span style="color: #a1db00;">case</span> msg <span style="color: #a1db00;">of</span>
        <span style="color: #00d7af;">GotRepositories</span> (<span style="color: #00d7af;">Ok</span> response) <span style="color: #d18aff;">-&gt;</span>
            ( <span style="color: #a1db00;">{</span> model
                <span style="color: #d18aff;">|</span> repositories <span style="color: #d18aff;">=</span>
                    <span style="color: #a1db00;">case</span> model<span style="color: #d18aff;">.</span>repositories <span style="color: #a1db00;">of</span>
                        <span style="color: #00d7af;">Nothing</span> <span style="color: #d18aff;">-&gt;</span>
                            <span style="color: #00d7af;">Just</span> response

                        <span style="color: #00d7af;">Just</span> previous <span style="color: #d18aff;">-&gt;</span>
                            <span style="color: #00d7af;">Just</span> (<span style="color: #00d7af;">Paginated</span><span style="color: #d18aff;">.</span>update previous response)
              <span style="color: #a1db00;">}</span>
            <span style="color: #a1db00;">,</span> <span style="color: #a1db00;">case</span> response <span style="color: #a1db00;">of</span>
                <span style="color: #00d7af;">Partial</span> request _ <span style="color: #d18aff;">-&gt;</span>
                    <span style="color: #00d7af;">Paginated</span><span style="color: #d18aff;">.</span>send <span style="color: #00d7af;">GotRepositories</span> request

                <span style="color: #00d7af;">Complete</span> _ <span style="color: #d18aff;">-&gt;</span>
                    <span style="color: #00d7af;">Cmd</span><span style="color: #d18aff;">.</span>none
            )

        <span style="color: #00d7af;">GotRepositories</span> (<span style="color: #00d7af;">Err</span> _) <span style="color: #d18aff;">-&gt;</span>
            ( { model <span style="color: #d18aff;">|</span> repositories <span style="color: #d18aff;">=</span> <span style="color: #00d7af;">Nothing</span> }
            <span style="color: #a1db00;">,</span> <span style="color: #00d7af;">Cmd</span><span style="color: #d18aff;">.</span>none
            )


<span style="color: #ffd700;">view</span> <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">Model</span> <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Html</span> <span style="color: #00d7af;">Msg</span>
<span style="color: #ffd700;">view</span> model <span style="color: #d18aff;">=</span>
    <span style="color: #a1db00;">case</span> model<span style="color: #d18aff;">.</span>repositories <span style="color: #a1db00;">of</span>
        <span style="color: #00d7af;">Nothing</span> <span style="color: #d18aff;">-&gt;</span>
            <span style="color: #00d7af;">Html</span><span style="color: #d18aff;">.</span>div [] [ <span style="color: #00d7af;">Html</span><span style="color: #d18aff;">.</span>text <span style="color: #ff4ea3;">"Loading"</span> ]

        <span style="color: #00d7af;">Just</span> (<span style="color: #00d7af;">Partial</span> _ _) <span style="color: #d18aff;">-&gt;</span>
            <span style="color: #00d7af;">Html</span><span style="color: #d18aff;">.</span>div [] [ <span style="color: #00d7af;">Html</span><span style="color: #d18aff;">.</span>text <span style="color: #ff4ea3;">"Loading..."</span> ]

        <span style="color: #00d7af;">Just</span> (<span style="color: #00d7af;">Complete</span> repos) <span style="color: #d18aff;">-&gt;</span>
            <span style="color: #00d7af;">Html</span><span style="color: #d18aff;">.</span>ul [] <span style="color: #d18aff;">&lt;|</span>
                <span style="color: #00d7af;">List</span><span style="color: #d18aff;">.</span>map
                    (<span style="color: #d18aff;">\</span>x <span style="color: #d18aff;">-&gt;</span> <span style="color: #00d7af;">Html</span><span style="color: #d18aff;">.</span>li [] [ <span style="color: #00d7af;">Html</span><span style="color: #d18aff;">.</span>text x ])
                    repos


<span style="color: #ffd700;">getRepositories</span> <span style="color: #d18aff;">:</span> <span style="color: #00d7af;">Cmd</span> <span style="color: #00d7af;">Msg</span>
<span style="color: #ffd700;">getRepositories</span> <span style="color: #d18aff;">=</span>
    <span style="color: #00d7af;">Paginated</span><span style="color: #d18aff;">.</span>send <span style="color: #00d7af;">GotRepositories</span> <span style="color: #d18aff;">&lt;|</span>
        <span style="color: #00d7af;">Paginated</span><span style="color: #d18aff;">.</span>get
            <span style="color: #ff4ea3;">"http://git.phoenixinquis.net/api/v4/projects?per_page=5"</span>
            (field <span style="color: #ff4ea3;">"name"</span> string)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6da6934" class="outline-2">
<h2 id="org6da6934">There's got to be a better way</h2>
<div class="outline-text-2" id="text-org6da6934">
<p>
I've got it working, and it's working well. However, it's kind of a
pain to use. It's nice that I can play with the results as they come
in by peeking into the <code>Partial</code> structure, but it's a real chore to
have to stitch the results together in my application's <code>update</code>
method. It'd be nice if I could somehow encapsulate that behavior in
my request and not have to worry about the pagination at all in my
app.
</p>

<p>
It just so happens that, with Tasks, I can.
</p>

<p>
<i>To be continued&#x2026;</i>
</p>

<p>
<i>For now, feel free to check out the full library documentation and
code referenced in this post <a href="http://package.elm-lang.org/packages/correl/elm-paginated/1.0.1">here</a>.</i>
</p>
</div>
</div>
